app/controllers/friends_controller.rb

SELECT * FROM "friends"
---
  def index
    @friends = Friend.all

SELECT * FROM "friends" WHERE ("friends"."id" = 0)
---
  def show
    @friend = Friend.find(params[:id])

SELECT * FROM "friends" WHERE ("friends"."person_id" = 1 AND "friends"."friend_id" = 2)
SELECT * FROM "friends"
INSERT INTO "friends" ("created_at", "updated_at", "person_id", "status", "friend_id") VALUES('2009-09-24 11:34:30', '2009-09-24 11:34:30', 2, NULL, 3)
UPDATE "friends" SET "updated_at" = '2009-09-24 12:47:33', "status" = 't' WHERE "id" = 9
---
  def new
    re = Person.find_by_alias(params[:person_id])
    @find_f = Friend.find(:all,
                          :conditions=>{:person_id=>self.person.id,
                                        :friend_id=>re.id})
    unless @find_f.first.nil?
      friend = Friend.new(:friend_id => self.person.id,
                          :person_id => re.id,:status=>true)
      if friend.save && @find_f.first.update_attribute(:status,true)