app/controllers/people_controller.rb

  def show
    @person = Person.find_by_alias(params[:id])
    @friend_ask = @person.friends.find(:all, :conditions =>{:status=>false})
---
SELECT * FROM "friends" WHERE ("friends".person_id = 3 AND ("friends"."status" = 'f'))