app/controllers/posts_controller.rb

  def edit
    @person = Person.find_by_alias(params[:person_id])
    @post = Post.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)

  def create
    @post = Post.new(params[:post])
    tags = params[:tag][:tag].split(' ')
    respond_to do |format|
      if @post.save
        for tag in tags
          tag_param = Tag.new(:post_id => @post.id, :tag => tag)
          begin
            tag_param.save
---
INSERT INTO "posts" ("created_at", "body", "person_id") VALUES('2009-09-13 14:51:44', 'hello', 1)
INSERT INTO "tags" ("created_at", "updated_at", "post_id", "tag") VALUES('2009-09-22 04:24:40', '2009-09-22 04:24:40', 4, 'python')